{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Learn to use ipython-cypher to query Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### install Neo4j community version docker image\n",
    "```\n",
    "docker pull neo4j:3.4.8\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Neo4j is in a docker container\n",
    "\n",
    "```\n",
    "docker run \\\n",
    "    --publish=7474:7474 --publish=7687:7687 \\\n",
    "    --volume=$HOME/workspace/neo4j/data:/data \\\n",
    "    --volume=$HOME/workspace/neo4j/logs:/logs \\\n",
    "    --volume=$HOME/workspace/neo4j/import:/var/lib/neo4j/import \\\n",
    "    neo4j:3.4.8\n",
    "```\n",
    "\n",
    "This binds two ports (7474 and 7687) for HTTP and Bolt access to the Neo4j API. A volume is bound to /data to allow the database to be persisted outside the container. /logs to allow you access to neo4j logs. You should put all your CSV files to be imported in /import folder. you can also bind 7473 for HTTPS access.\n",
    "\n",
    "in your browser, open \"http://localhost:7474\" to access the neo4j web. use neo4j/neo4j to login. or disable authentication by passing --env=NEO4J_AUTH=none to docker run"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### use jupyter note to execute cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "%config CypherMagic.uri='http://neo4j:1234@localhost:7474'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Carrie-Anne Moss&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Lilly Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'born': 1967, 'name': 'Carrie-Anne Moss'}],\n",
       " [{'born': 1961, 'name': 'Laurence Fishburne'}],\n",
       " [{'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'born': 1967, 'name': 'Lilly Wachowski'}]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher match(n:Person) return n limit 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>tom</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1956, 'name': 'Tom Hanks'}]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher MATCH (tom {name: \"Tom Hanks\"}) RETURN tom"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n",
      "+-------------------------------------+\n",
      "|                 tom                 |\n",
      "+-------------------------------------+\n",
      "| {'born': 1956, 'name': 'Tom Hanks'} |\n",
      "+-------------------------------------+\n"
     ]
    }
   ],
   "source": [
    "result = %cypher MATCH (tom {name: \"Tom Hanks\"}) RETURN tom\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## import data to Neo4j through excel file (CSV file)\n",
    "\n",
    "#### convert excel file (xlsx file) to CSV file\n",
    "If you don't have Office installed, use LibreOffice (it's free) to open your excel file and save the file as CSV file.\n",
    "### two ways to import\n",
    "* cypher command \"LOAD CSV\"  : install to an existing database\n",
    "* neo4j-admin load  : install to a brand new and empty database"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### LOAD CSV\n",
    "1. create csv file inv.csv for inventory basic info (csv must be UTF-8 format). On MacBook, save inv.csv to $HOME/workspace/neo4j/import\n",
    "\n",
    "```\n",
    "uniqid,name,sn\n",
    "123,My PC 001,SN001\n",
    "124,My PC 002,SN002\n",
    "125,My PC 003,SN003\n",
    "```\n",
    "\n",
    "2. load inv.csv to database\n",
    "```\n",
    "LOAD CSV WITH HEADERS FROM \"file:///inv.csv\" as line\n",
    "CREATE (p:InventoryItem {uniqid: line.uniqid, name: line.name, sn: line.sn})\n",
    "```\n",
    "\n",
    "3. create csv file dep.csv for department info.\n",
    "```\n",
    "uniqid,n1,n2\n",
    "123,Wireless Network,3G\n",
    "124,Wireless Network,4G\n",
    "125,Wireless Network,5G\n",
    "```\n",
    "\n",
    "4. create index on InventoryItem(uniqid) as we'll use uniqid as key to connect inv.csv and dep.csv\n",
    "```\n",
    "CREATE INDEX ON :InventoryItem(uniqid)\n",
    "```\n",
    "\n",
    "5. load dep.csv and create Relationships\n",
    "```\n",
    "LOAD CSV WITH HEADERS FROM \"file:///dep.csv\" AS line\n",
    "MATCH (inv:InventoryItem { uniqid: line.uniqid})\n",
    "MERGE (n1:Department1 {name: line.n1})\n",
    "MERGE (n2:Department2 {name: line.n2})\n",
    "CREATE (inv)<-[:Owns]-(n2)<-[:Sub_Department]-(n1)\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://neo4j.com/graphgist/importing-csv-files-with-cypher\n",
    "\n",
    "https://neo4j.com/docs/developer-manual/3.4/get-started/cypher/importing-csv-files-with-cypher/"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## delete all nodes and relationships\n",
    "```\n",
    "MATCH (n)\n",
    "DETACH DELETE n\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
